УчетВУправляющихДляГит1/src/Documents/КадровыйПеревод/КадровыйПеревод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровыйПеревод</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>InformationRegister.ПлановыеАвансы</registerRecords>
  <registerRecords>InformationRegister.КадроваяИсторияСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПараметрыПериодовСтажаПФР</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.ВидыЗанятостиСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьПодразделениеИДолжность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПеревода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПеревода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьАванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаАванса</name>
    <type>
      <types>EnumRef.СпособыРасчетаАванса</types>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапрета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Enums/СостоянияСотрудника/СостоянияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСотрудника</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>ОтпускОсновной</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоЗаконодательству</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/КадровыйПеревод/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Приказ о переводе
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "ПФ_MXL_Т5";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о переводе (Т-5)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Функция ДанныеДляРегистрацииВУчетаСтажаПФР(МассивСсылок) Экспорт
		ДанныеДляРегистрацииВУчете = Новый Соответствие;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадровыйПеревод.Ссылка,
	|	КадровыйПеревод.Сотрудник,
	|	КадровыйПеревод.ДатаНачала,
	|	КадровыйПеревод.Подразделение,
	|	КадровыйПеревод.ОбособленноеПодразделение КАК Организация,
	|	КадровыйПеревод.Должность,
	|	КадровыйПеревод.ВидЗанятости,
	|	КадровыйПеревод.ИзменитьПодразделениеИДолжность
	|ИЗ
	|	Документ.КадровыйПеревод КАК КадровыйПеревод
	|ГДЕ
	|	КадровыйПеревод.Ссылка В(&МассивСсылок)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИзменитьПодразделениеИДолжность Тогда
			ДанныеДляРегистрацииВУчетеПоДокументу = УчетСтажаПФР.ДанныеДляРегистрацииВУчетеСтажаПФР();
			ДанныеДляРегистрацииВУчете.Вставить(Выборка.Ссылка, ДанныеДляРегистрацииВУчетеПоДокументу); 
			
			ОписаниеПериода = УчетСтажаПФР.ОписаниеРегистрируемогоПериода();
			ОписаниеПериода.Сотрудник = Выборка.Сотрудник;
			ОписаниеПериода.ДатаНачалаПериода = Выборка.ДатаНачала;
			ОписаниеПериода.Состояние = Перечисления.СостоянияСотрудника.Работа;
			ОписаниеПериода.ВидЗанятости = Выборка.ВидЗанятости;
				
			РегистрируемыйПериод = УчетСтажаПФР.ДобавитьЗаписьВДанныеДляРегистрацииВУчета(ДанныеДляРегистрацииВУчетеПоДокументу, ОписаниеПериода);
			УчетСтажаПФР.УстановитьЗначениеРегистрируемогоРесурса(РегистрируемыйПериод, "Должность", Выборка.Должность);
			УчетСтажаПФР.УстановитьЗначениеРегистрируемогоРесурса(РегистрируемыйПериод, "Организация", Выборка.Организация);
			УчетСтажаПФР.УстановитьЗначениеРегистрируемогоРесурса(РегистрируемыйПериод, "Подразделение", Выборка.Подразделение);
		КонецЕсли;					
	КонецЦикла;	

	Возврат ДанныеДляРегистрацииВУчете;														
КонецФункции

Процедура ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента) Экспорт
	
	ЗарплатаКадры.ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента, "ДатаНачала");
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, СписокСотрудников = Неопределено) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Т5") Тогда
		
		ДанныеСсылок = Новый ДеревоЗначений;
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъект");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектОрганизацияНаименованиеСокращенное");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектОрганизацияКодПоОКПО");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектДата");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектНомерНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаДатаНачалаПеревода");
		ДанныеСсылок.Колонки.Добавить("РаботаСотрудник");
		ДанныеСсылок.Колонки.Добавить("РаботаСотрудникТабельныйНомерНаПечать");
		ДанныеСсылок.Колонки.Добавить("ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже");
		ДанныеСсылок.Колонки.Добавить("РаботаВидПеревода");
		ДанныеСсылок.Колонки.Добавить("РаботаПодразделениеПрежнееНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаДолжностьПрежняя");
		ДанныеСсылок.Колонки.Добавить("РаботаПричинаПеревода");
		ДанныеСсылок.Колонки.Добавить("РаботаПодразделениеНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаДолжность");
		ДанныеСсылок.Колонки.Добавить("РаботаСведенияОбОплатеТрудаТарифнаяСтавкаНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаОснованиеПеревода");
		ДанныеСсылок.Колонки.Добавить("РаботаТрудовойДоговорДатаОформленияНаПечать");
		ДанныеСсылок.Колонки.Добавить("РаботаТрудовойДоговорНомер");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектДолжностьРуководителя");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектРуководительРасшифровкаПодписи");
		ДанныеСсылок.Колонки.Добавить("СсылкаНаОбъектДатаОзнакомленияРаботника");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КадровыйПеревод.Ссылка КАК Ссылка,
			|	КадровыйПеревод.ДатаНачала КАК Дата,
			|	КадровыйПеревод.Ссылка КАК СсылкаНаОбъект,
			|	КадровыйПеревод.Организация.НаименованиеСокращенное КАК СсылкаНаОбъектОрганизацияНаименованиеСокращенное,
			|	КадровыйПеревод.Организация.КодПоОКПО КАК СсылкаНаОбъектОрганизацияКодПоОКПО,
			|	КадровыйПеревод.Сотрудник КАК РаботаСотрудник,
			|	КадровыйПеревод.Сотрудник.Код КАК РаботаСотрудникКод,
			|	КадровыйПеревод.ДатаНачала КАК РаботаДатаНачалаПеревода,
			|	КадровыйПеревод.Номер КАК СсылкаНаОбъектНомер,
			|	КадровыйПеревод.Дата КАК СсылкаНаОбъектДата,
			|	КадровыйПеревод.Руководитель КАК СсылкаНаОбъектРуководитель,
			|	КадровыйПеревод.ДолжностьРуководителя КАК СсылкаНаОбъектДолжностьРуководителя,
			|	КадровыйПеревод.ОснованиеПеревода КАК РаботаОснованиеПеревода,
			|	КадровыйПеревод.ПричинаПеревода КАК РаботаПричинаПеревода
			|ПОМЕСТИТЬ ВТДанныеДокументовКадровыхПеремещений
			|ИЗ
			|	Документ.КадровыйПеревод КАК КадровыйПеревод
			|ГДЕ
			|	КадровыйПеревод.Ссылка В(&МассивОбъектов)
			|	И КадровыйПеревод.Проведен";
		
		Запрос.Выполнить();
	
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДанныеДокументов.РаботаСотрудник КАК Сотрудник,
			|	ДОБАВИТЬКДАТЕ(ДанныеДокументов.РаботаДатаНачалаПеревода, ДЕНЬ, -1) КАК Период
			|ПОМЕСТИТЬ ВТСотрудникиПериоды
			|ИЗ
			|	ВТДанныеДокументовКадровыхПеремещений КАК ДанныеДокументов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеДокументов.РаботаСотрудник,
			|	ДанныеДокументов.РаботаДатаНачалаПеревода
			|ИЗ
			|	ВТДанныеДокументовКадровыхПеремещений КАК ДанныеДокументов";
		
		Запрос.Выполнить();
	
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
		
		ОписательВременныхТаблиц.ИмяВТКадровыеДанныеСотрудников = "ВТКадровыеДанныеСотрудниковДляТ5";
		
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
			ОписательВременныхТаблиц,
			Истина,
			"ФИОПолные,Пол,Подразделение,Должность");

		ИменаПолейОтветственныхЛиц = Новый Массив;
		ИменаПолейОтветственныхЛиц.Добавить("СсылкаНаОбъектРуководитель");
		
		ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Ложь, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументовКадровыхПеремещений");
		
		Запрос.УстановитьПараметр("Постоянно", НСтр("ru='постоянно'"));
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДанныеДокументов.СсылкаНаОбъект КАК СсылкаНаОбъект,
			|	ДанныеДокументов.СсылкаНаОбъектОрганизацияНаименованиеСокращенное КАК СсылкаНаОбъектОрганизацияНаименованиеСокращенное,
			|	ДанныеДокументов.СсылкаНаОбъектОрганизацияКодПоОКПО КАК СсылкаНаОбъектОрганизацияКодПоОКПО,
			|	ДанныеДокументов.СсылкаНаОбъектДата КАК СсылкаНаОбъектДата,
			|	ДанныеДокументов.СсылкаНаОбъектНомер КАК СсылкаНаОбъектНомер,
			|	ДанныеДокументов.РаботаДатаНачалаПеревода КАК РаботаДатаНачалаПеревода,
			|	ДанныеДокументов.РаботаСотрудник КАК РаботаСотрудник,
			|	ДанныеДокументов.РаботаСотрудникКод КАК РаботаСотрудникКод,
			|	КадровыеДанныеСотрудниковНовые.ФИОПолные КАК ЛичныеДанныеФИОПолные,
			|	КадровыеДанныеСотрудниковНовые.Пол КАК ЛичныеДанныеПол,
			|	&Постоянно КАК РаботаВидПеревода,
			|	КадровыеДанныеСотрудниковПредыдущие.Подразделение КАК РаботаПодразделениеПрежнее,
			|	КадровыеДанныеСотрудниковПредыдущие.Должность КАК РаботаДолжностьПрежняя,
			|	ДанныеДокументов.РаботаПричинаПеревода КАК РаботаПричинаПеревода,
			|	КадровыеДанныеСотрудниковНовые.Подразделение КАК РаботаПодразделение,
			|	КадровыеДанныеСотрудниковНовые.Должность КАК РаботаДолжность,
			|	ДанныеДокументов.РаботаОснованиеПеревода КАК РаботаОснованиеПеревода,
			|	ДанныеДокументов.СсылкаНаОбъектДолжностьРуководителя КАК СсылкаНаОбъектДолжностьРуководителя,
			|	ФИООтветственныхЛиц.РасшифровкаПодписи КАК СсылкаНаОбъектРуководительРасшифровкаПодписи
			|ИЗ
			|	ВТДанныеДокументовКадровыхПеремещений КАК ДанныеДокументов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудниковДляТ5 КАК КадровыеДанныеСотрудниковПредыдущие
			|		ПО ДанныеДокументов.РаботаСотрудник = КадровыеДанныеСотрудниковПредыдущие.Сотрудник
			|			И ДанныеДокументов.РаботаДатаНачалаПеревода > КадровыеДанныеСотрудниковПредыдущие.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудниковДляТ5 КАК КадровыеДанныеСотрудниковНовые
			|		ПО ДанныеДокументов.РаботаСотрудник = КадровыеДанныеСотрудниковНовые.Сотрудник
			|			И ДанныеДокументов.РаботаДатаНачалаПеревода = КадровыеДанныеСотрудниковНовые.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИООтветственныхЛиц
			|		ПО ДанныеДокументов.СсылкаНаОбъектРуководитель = ФИООтветственныхЛиц.ФизическоеЛицо
			|			И ДанныеДокументов.СсылкаНаОбъект = ФИООтветственныхЛиц.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	СсылкаНаОбъект";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("СсылкаНаОбъект") Цикл
			
			СтрокаСсылки = ДанныеСсылок.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСсылки, Выборка);
			
			СтрокаСсылки.СсылкаНаОбъектНомерНаПечать = ЗарплатаКадрыОтчеты.НомерНаПечать(Выборка.СсылкаНаОбъектНомер);
			
			СтрокаСсылки.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже =
				ЗарплатаКадрыОтчеты.ПросклоненныеФИО(Выборка.ЛичныеДанныеФИОПолные, 4, Выборка.ЛичныеДанныеПол);
			
			СтрокаСсылки.РаботаСотрудникТабельныйНомерНаПечать = ЗарплатаКадрыОтчеты.ТабельныйНомерНаПечать(Выборка.РаботаСотрудникКод);
			СтрокаСсылки.РаботаПодразделениеПрежнееНаПечать = ЗарплатаКадрыОтчеты.ПодразделениеНаПечать(Выборка.РаботаПодразделениеПрежнее);
			СтрокаСсылки.РаботаПодразделениеНаПечать = ЗарплатаКадрыОтчеты.ПодразделениеНаПечать(Выборка.РаботаПодразделение);
			
			СтрокаСсылки.РаботаТрудовойДоговорДатаОформленияНаПечать = ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью('00010101');
			СтрокаСсылки.РаботаТрудовойДоговорНомер = "_____";
			
			СтрокаСсылки.СсылкаНаОбъектДатаОзнакомленияРаботника = ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью(СтрокаСсылки.СсылкаНаОбъектДата);
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаСотрудника = СтрокаСсылки.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСотрудника, СтрокаСсылки);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ДокументРезультат = Новый ТабличныйДокумент;
		КадровыйУчет.ВывестиНаПечатьТ5(ДокументРезультат, ДанныеСсылок.Строки, УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Т5"), , ОбъектыПечати);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Т5",
			НСтр("ru = 'Приказ о переводе (Т-5)'"),
			ДокументРезультат,,);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДатыЗапрета(ПараметрыОбновления) Экспорт
	
	ОбновлениеВыполнено = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	КадровыйПеревод.Ссылка КАК Ссылка,
		|	КадровыйПеревод.Дата КАК Дата
		|ИЗ
		|	Документ.КадровыйПеревод КАК КадровыйПеревод
		|ГДЕ
		|	КадровыйПеревод.ДатаЗапрета = ДАТАВРЕМЯ(1, 1, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КадровыйПеревод.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ОбновлениеВыполнено = Ложь;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, Выборка.Ссылка.Метаданные().ПолноеИмя(), "Ссылка", Выборка.Ссылка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			
			МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Выборка.Ссылка);
			МенеджерДокумента.ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента);
			
			ОбъектДокумента.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДокумента);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбновлениеВыполнено);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
